common/models/Article.php

UPDATE `article` SET `status`=1 WHERE `id`=13
---
    public function publish()
    {
        $this->status = self::STATUS_PUBLISHED;
        return $this->save(false);