common/models/CommentQuery.php

SELECT * FROM `comment` ORDER BY `id` DESC
---
    public function all($db = null)
    {
        return parent::all($db);