common/models/RU_Blog.php

SELECT COUNT(*) FROM `RU_Blog`
---
    public static function getAll($pageSize = 5)
    {

        $query = RU_Blog::find()->latest();


        $count = $query->count();