common/models/query/VideoQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `video` WHERE `video_id`='PAnKGl9G'